Revit 2026 API

# SpaceActualPowerLoad Property

---

Get the Actual Power Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualPowerLoad { get; }
```
```vb
Public ReadOnly Property ActualPowerLoad As Double
	Get
```
```cpp
public:
property double ActualPowerLoad {
	double get ();
}
```
```fsharp
member ActualPowerLoad : float with get
```

#### Property Value

Double

This property is used to get the Actual Power Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace